Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

data1 = [4, 8, 15, 16, 23, 42]
data1_series = pd.Series(data1)
print(data1_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

C:\Users\POOJA\AppData\Local\Temp\ipykernel_8676\1596279938.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [2]:
data2 = [1, 4, 9, 16, 25, 36, 49, 64, 81, 100]
pd.Series(data2)

0      1
1      4
2      9
3     16
4     25
5     36
6     49
7     64
8     81
9    100
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Name       Age          Gendere

Alice      25           Female

Bob        30            Male

Claire     27           Female


Then, print the DataFrame.

In [3]:
data3 = [["Name","Age","Gender"],["Alice",25,"Female"],["Bob",30,"Male"],["Claire",27,"Female"]]
pd.DataFrame(data3)

        0    1       2
0    Name  Age  Gender
1   Alice   25  Female
2     Bob   30    Male
3  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

 DataFrame is a two-dimensional, tabular data structure with labeled axes (rows and columns). It is similar to a spreadsheet or SQL table and is designed to handle a wide variety of data types. Each column in a DataFrame can be of a different data type, and you can perform various operations like filtering, grouping, and merging on DataFrames.

 On the other hand, a Pandas Series is a one-dimensional labeled array capable of holding data of any type. It is essentially a single column of a DataFrame. A DataFrame consists of multiple Series, where each Series represents a column.

In [4]:
data = [["Name","Age","Gender"],["Alice",25,"Female"],["Bob",30,"Male"],["Claire",27,"Female"]]
Series_data = pd.Series(data)
df_data = pd.DataFrame(data)
print("Series: \n",Series_data)
print("DataFrame: \n",df_data)

Series:
 0     [Name, Age, Gender]
1     [Alice, 25, Female]
2         [Bob, 30, Male]
3    [Claire, 27, Female]
dtype: object
DataFrame:
         0    1       2
0    Name  Age  Gender
1   Alice   25  Female
2     Bob   30    Male
3  Claire   27  Female

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Pandas provides a wide range of functions for manipulating data in a DataFrame. Some common functions include:

In [5]:
df = pd.read_csv("C:\Python\Files\data.csv")

1. head() and tail(): Display the first or last n rows of a DataFrame.

In [6]:
df.head(3)

,name,surname,gender,age,subject,email_id,phone_number,Unnamed: 7
0,pooja,verma,female,21,maths,pooja@gmail.com,85798228,NaN
1,aanand,gupta,male,35,biology,aanand@gmail.com,628268865,NaN
2,dipika,maurya,female,25,Dfarma,dipika@gmail.com,6548652356,NaN

In [7]:
df.tail(3)

,name,surname,gender,age,subject,email_id,phone_number,Unnamed: 7
6,kajal,Singh,female,33,IT,kajal@gmail.com,66869746696,NaN
7,aaryan,verma,male,36,hindi,aaryan@gmail.com,6586865686,NaN
8,sanskar,modi,male,22,evs,sanskar@gmail.com,64585268365,NaN

2. info(): Display a concise summary of the DataFrame, including data types and missing values.

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   name          9 non-null      object
 1   surname       9 non-null      object
 2   gender        9 non-null      object
 3   age           9 non-null      int64
 4   subject       9 non-null      object
 5   email_id      9 non-null      object
 6   phone_number  9 non-null      int64
 7   Unnamed: 7    0 non-null      float64
dtypes: float64(1), int64(2), object(5)
memory usage: 708.0+ bytes

3. describe(): Generate descriptive statistics of the DataFrame's numeric columns.

In [9]:
df.describe()

             age  phone_number  Unnamed: 7
count   9.000000  9.000000e+00         0.0
mean   27.888889  2.612398e+10         NaN
std     6.132790  3.339106e+10         NaN
min    21.000000  8.579823e+07         NaN
25%    22.000000  9.786862e+08         NaN
50%    26.000000  6.586866e+09         NaN
75%    33.000000  6.458527e+10         NaN
max    36.000000  7.895469e+10         NaN

4. shape: Return a tuple representing the dimensions of the DataFrame (rows, columns).

In [10]:
df.shape

(9, 8)

5. loc[] and iloc[]: Access a group of rows and columns by labels (loc) or integer-based indexing (iloc).

In [11]:
df.loc[0,'name']    # Access the value in the first row and 'name' column

'pooja'

6. sort_values(): Sort the DataFrame by specified column(s).

In [12]:
df.sort_values(by='name', ascending=True)  #sort by name column in ascending order

,name,surname,gender,age,subject,email_id,phone_number,Unnamed: 7
1,aanand,gupta,male,35,biology,aanand@gmail.com,628268865,NaN
7,aaryan,verma,male,36,hindi,aaryan@gmail.com,6586865686,NaN
4,anshu,shah,male,26,chemistry,anshu@gmail.com,78954685687,NaN
2,dipika,maurya,female,25,Dfarma,dipika@gmail.com,6548652356,NaN
6,kajal,Singh,female,33,IT,kajal@gmail.com,66869746696,NaN
5,monika,gaikwad,female,21,maths,monika@gmail.com,9877857464,NaN
3,nikita,waghmare,female,32,nursing,nikita@gmail.com,978686183,NaN
0,pooja,verma,female,21,maths,pooja@gmail.com,85798228,NaN
8,sanskar,modi,male,22,evs,sanskar@gmail.com,64585268365,NaN

In [13]:
df.sort_values(by='surname', ascending=False)  #sort by surname column in descending order

,name,surname,gender,age,subject,email_id,phone_number,Unnamed: 7
3,nikita,waghmare,female,32,nursing,nikita@gmail.com,978686183,NaN
0,pooja,verma,female,21,maths,pooja@gmail.com,85798228,NaN
7,aaryan,verma,male,36,hindi,aaryan@gmail.com,6586865686,NaN
4,anshu,shah,male,26,chemistry,anshu@gmail.com,78954685687,NaN
8,sanskar,modi,male,22,evs,sanskar@gmail.com,64585268365,NaN
2,dipika,maurya,female,25,Dfarma,dipika@gmail.com,6548652356,NaN
1,aanand,gupta,male,35,biology,aanand@gmail.com,628268865,NaN
5,monika,gaikwad,female,21,maths,monika@gmail.com,9877857464,NaN
6,kajal,Singh,female,33,IT,kajal@gmail.com,66869746696,NaN

7. groupby(): Group DataFrame by a column and perform aggregate functions.

In [14]:
df.groupby('gender')['gender'].count()  #count the gender by gender

gender
female    5
male      4
Name: gender, dtype: int64

In [15]:
df.groupby('gender')['age'].mean()      #avg age by gender

gender
female    26.40
male      29.75
Name: age, dtype: float64

8. drop(): Remove specified rows or columns.

In [16]:
df.drop(index=8)    #remove the row with index 8

,name,surname,gender,age,subject,email_id,phone_number,Unnamed: 7
0,pooja,verma,female,21,maths,pooja@gmail.com,85798228,NaN
1,aanand,gupta,male,35,biology,aanand@gmail.com,628268865,NaN
2,dipika,maurya,female,25,Dfarma,dipika@gmail.com,6548652356,NaN
3,nikita,waghmare,female,32,nursing,nikita@gmail.com,978686183,NaN
4,anshu,shah,male,26,chemistry,anshu@gmail.com,78954685687,NaN
5,monika,gaikwad,female,21,maths,monika@gmail.com,9877857464,NaN
6,kajal,Singh,female,33,IT,kajal@gmail.com,66869746696,NaN
7,aaryan,verma,male,36,hindi,aaryan@gmail.com,6586865686,NaN

In [17]:
df

,name,surname,gender,age,subject,email_id,phone_number,Unnamed: 7
0,pooja,verma,female,21,maths,pooja@gmail.com,85798228,NaN
1,aanand,gupta,male,35,biology,aanand@gmail.com,628268865,NaN
2,dipika,maurya,female,25,Dfarma,dipika@gmail.com,6548652356,NaN
3,nikita,waghmare,female,32,nursing,nikita@gmail.com,978686183,NaN
4,anshu,shah,male,26,chemistry,anshu@gmail.com,78954685687,NaN
5,monika,gaikwad,female,21,maths,monika@gmail.com,9877857464,NaN
6,kajal,Singh,female,33,IT,kajal@gmail.com,66869746696,NaN
7,aaryan,verma,male,36,hindi,aaryan@gmail.com,6586865686,NaN
8,sanskar,modi,male,22,evs,sanskar@gmail.com,64585268365,NaN

9. fillna(): Fill missing values with a specified value or a calculated one.

In [18]:
df['Unnamed: 7'].fillna(df['age'].mean())

0    27.888889
1    27.888889
2    27.888889
3    27.888889
4    27.888889
5    27.888889
6    27.888889
7    27.888889
8    27.888889
Name: Unnamed: 7, dtype: float64

10. apply(): Apply a function along the axis of the DataFrame.

In [19]:
col = df['age']
df['age'] = df['age'].apply(lambda x : x + 2)    #increase age with 2year

In [20]:
print("Before Increment: \n",col)
print("After Increment by 2year: \n",df['age'])

Before Increment:
 0    21
1    35
2    25
3    32
4    26
5    21
6    33
7    36
8    22
Name: age, dtype: int64
After Increment by 2year:
 0    23
1    37
2    27
3    34
4    28
5    23
6    35
7    38
8    24
Name: age, dtype: int64

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series: We can change the values of a Series after it has been created.

In [21]:
my_series = pd.Series([1,2,3,4,5])
my_series[2] =15
print(my_series)

0     1
1     2
2    15
3     4
4     5
dtype: int64

DataFrame: We can modify values, add or remove columns, and perform various other operations on a DataFrame.

In [27]:
data4 = {'name':["pooja","shanti","dipika"],'age':[20,21,22]}
df = pd.DataFrame(data4)
df.loc[1,'age'] = 25    #modifying at row 1 of age column
df['Address'] = ['Mumbai','pune','Nasik']    #add new column
print(df)

     name  age Address
0   pooja   20  Mumbai
1  shanti   25    pune
2  dipika   22   Nasik

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [28]:
no_series = pd.Series([1,2,3,4,5] , name ="Number")
sqr_series = pd.Series([1,4,9,16,25] , name = "Square")
cube_series = pd.Series([1,8,27,64,125] ,name = "Cube")
 
data5 = {'Number':no_series , 'Square':sqr_series , 'Cube':cube_series}
df = pd.DataFrame(data5)
print(df)

   Number  Square  Cube
0       1       1     1
1       2       4     8
2       3       9    27
3       4      16    64
4       5      25   125